src/customer/windService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:req="http://futureweather/windspeed/request"
                  xmlns:rsp="http://futureweather/windspeed/response"
                  xmlns:flt="http://futureweather/windspeed/fault"
                  xmlns:tns="http://futureweather/windspeed/message"
                  targetNamespace="http://futureweather/windspeed/message">

    <wsdl:types>
        <xsd:schema>
            <xsd:import namespace="http://futureweather/windspeed/request"
                        schemaLocation="windRequest.xsd" />
            <xsd:import namespace="http://futureweather/windspeed/response"
                        schemaLocation="windResponse.xsd" />
            <xsd:import namespace="http://futureweather/windspeed/fault"
                        schemaLocation="windFault.xsd" />
        </xsd:schema>
    </wsdl:types>

    <wsdl:message name="request">
        <wsdl:part name="request" element="req:windspeedrequest"/>
    </wsdl:message>
    <wsdl:message name="response">
        <wsdl:part name="response" element="rsp:windspeedresponse"/>
    </wsdl:message>
    <wsdl:message name="fault">
        <wsdl:part name="fault" element="flt:faulthandling"/>
    </wsdl:message>

    <wsdl:portType name="WS-Interface">
        <wsdl:operation name="getWindSpeed">
            <wsdl:input message="tns:request"/>
            <wsdl:output message="tns:response"/>
            <wsdl:fault name="fault" message="tns:fault"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="WS-Binding" type="tns:WS-Interface">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="getWindSpeed">
            <soap:operation soapAction="" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
            <wsdl:fault name="fault">
                <soap:fault name="fault" use="literal"/>
            </wsdl:fault>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="windService">
        <wsdl:port name="WS-Port" binding="tns:WS-Binding">
            <soap:address location="http://localhost:8080/futureWeather/getTheWindspeed/"/>
        </wsdl:port>
    </wsdl:service>

</wsdl:definitions>