SOAP/getWindspeed1.request.soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:req="http://futureweather/windspeed/request">
    <soapenv:Header/>
    <soapenv:Body>
        <req:windspeedrequest>
            <!--You may enter the following 2 items in any order-->
            <dateTime>
                <!--You may enter the following 2 items in any order-->
                <date>2017-02-02</date>
                <time>09:00:00</time>
            </dateTime>
            <location>
                <!--You may enter the following 2 items in any order-->
                <latitude>90</latitude>
                <longitude>180</longitude>
            </location>
        </req:windspeedrequest>
    </soapenv:Body>
</soapenv:Envelope>